public class Main {

    public static void main(String[] args) {

        /*
        Привет!
        Немного освободился в работе и сразу в учебу! Исправления в этот раз мне показались вообще самыми полезными из
        всех! Компаратор выглядит красивее, проверка задач на null - все гениальное просто! А тестовые классы сократил
        на 260 строк! При том же функционале!
        Словом, я доволен))
        Но жду максимально конструктивной и подробной критики, хочу, чтобы все было близко к идеалу))
 */

    }
}
