public class Main {

    public static void main(String[] args) {

        /*
        * Привет!
        * Да уж, надеялся сдать работу еще во вторник, а в итоге уже воскресенье. Но, такого объемного задания
        * у нас еще не было. И интересного. В процессе тестирования нашел столько ошибок, оптимизировал столько
        * моментов, что аж страшно стало, как это раньше работало :)
        * Текущей версией я, в принципе доволен. НО если ты найдешь, что еще можно улучшить, то буду очень благодарен!
        * По части тестов, не знаю, как они выглядят в реальных программах, но у меня они точно жуткие. Хотелось
        * охватить тестами каждый нюанс работы и каждую неочевидную мелочь, надеюсь что так и нужно делать в реальной
        * работе. Если нет - жду рекомендаций!
        * Спасибо большое за помощь в слаке!
        * */

    }
}
